In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
frame = pd.DataFrame(np.random.randn(4, 3), 
                   columns=list('bde'),
                   index=['Ohio', 'Texas', 'Utah', 'Orengon'])
frame

                b         d         e
Ohio    -1.444118  0.368325 -0.926866
Texas    0.973610  0.090482  1.431062
Utah    -1.380967  0.980513  1.297350
Orengon -0.794662  1.479538  0.515613

In [3]:
np.abs(frame)

                b         d         e
Ohio     1.444118  0.368325  0.926866
Texas    0.973610  0.090482  1.431062
Utah     1.380967  0.980513  1.297350
Orengon  0.794662  1.479538  0.515613

In [4]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.417728
d    1.389056
e    2.357928
dtype: float64

In [5]:
f = lambda x: x.max() - x.min()
frame.apply(f, axis='columns')

Ohio       1.812443
Texas      1.340580
Utah       2.678318
Orengon    2.274200
dtype: float64

In [6]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min -1.444118  0.090482 -0.926866
max  0.973610  1.479538  1.431062

In [7]:
format = lambda x: '%.2f' % x
frame.applymap(format)

             b     d      e
Ohio     -1.44  0.37  -0.93
Texas     0.97  0.09   1.43
Utah     -1.38  0.98   1.30
Orengon  -0.79  1.48   0.52

In [8]:
frame['e'].map(format)

Ohio       -0.93
Texas       1.43
Utah        1.30
Orengon     0.52
Name: e, dtype: object